docs/floyd_warshall.html
<!doctype html>
<html lang="en">
<head>
<title>Algoritmo di Floyd-Warshall</title>
<!-- 2022-05-12 Thu 10:04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Specifiche preliminari</a></li>
<li><a href="#sec-2">2. Formula divisa in sottoproblemi (programmazione dinamica)</a></li>
<li><a href="#sec-3">3. Algoritmo</a></li>
<li><a href="#sec-4">4. Complessità</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Algoritmo di Floyd-Warshall</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Specifiche preliminari</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Dati G = (V, E) e V = {1, 2, &#x2026;, n}
</p>

<p>
W = (w<sub>ij</sub>) ∈ R<sup>(n*n)</sup> -&gt; matrice n*n
</p>

<p>
in cui <b>w<sub>ij</sub></b> è uguale a:
<br>
</p>
<ol class="org-ol">
<li><b>0</b> se i == j;
</li>
<li><b>w<sub>ij</sub></b> se i != j e (i, j) in E;
</li>
<li><b>+inf</b> se i != j e (i, j) not in E
</li>
</ol>
<p>
<br>
<br>
Dato D<sub>ij</sub> = {p | p è cammino minimo semplice tra i e j}, alla fine dell&rsquo;algoritmo:
<br>
<b>d<sub>ij</sub><sup>(k)</sup> = δ(i, j) = min w(p), p ∈ D<sub>ij</sub><sup>(k)</sup></b>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Formula divisa in sottoproblemi (programmazione dinamica)</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
<b>d<sub>ij</sub><sup>(k)</sup></b> è uguale a:
<br>
</p>
<ol class="org-ol">
<li><b>w<sub>ij</sub></b> se k = 0;
</li>
<li><b>min(d<sub>ik</sub><sup>(k-1)</sup> + d<sub>kj</sub><sup>(k-1)</sup>, d<sub>ij</sub><sup>(k-1)</sup>)</b> se k != 0.
</li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Algoritmo</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a89984;">/*</span>
<span style="color: #a89984;">W = matrice n*n</span>

<span style="color: #a89984;">PREREQUISITI: accetta pesi negativi, ma non cicli negativi.</span>
<span style="color: #a89984;">*/</span>
<span style="color: #8f3f71;">FLOYD</span>-<span style="color: #8f3f71;">WARSHALL</span><span style="color: #076678;">(</span>W<span style="color: #076678;">){</span>
    n &lt;- rows<span style="color: #b16286;">(</span>W<span style="color: #b16286;">)</span>
    D^<span style="color: #b16286;">(</span><span style="color: #8f3f71; font-weight: bold;">0</span><span style="color: #b16286;">)</span> &lt;- W

    <span style="color: #9d0006;">for</span> k = <span style="color: #8f3f71; font-weight: bold;">1</span> TO n<span style="color: #b16286;">{</span>
        <span style="color: #9d0006;">for</span> i = <span style="color: #8f3f71; font-weight: bold;">1</span> TO n<span style="color: #8ec07c;">{</span>
            <span style="color: #9d0006;">for</span> j = <span style="color: #8f3f71; font-weight: bold;">1</span> TO n<span style="color: #d65d0e;">{</span>
                d_ij^<span style="color: #076678;">(</span>k<span style="color: #076678;">)</span> = min<span style="color: #076678;">(</span>d_ik^<span style="color: #b16286;">(</span>k-<span style="color: #8f3f71; font-weight: bold;">1</span><span style="color: #b16286;">)</span> + d_kj^<span style="color: #b16286;">(</span>k-<span style="color: #8f3f71; font-weight: bold;">1</span><span style="color: #b16286;">)</span>, d_ij^<span style="color: #b16286;">(</span>k-<span style="color: #8f3f71; font-weight: bold;">1</span><span style="color: #b16286;">)</span>
            <span style="color: #9d0006; font-weight: bold;">}</span>
        <span style="color: #d65d0e;">}</span>
    <span style="color: #8ec07c;">}</span>

    <span style="color: #9d0006;">return</span> D^<span style="color: #8ec07c;">(</span>n<span style="color: #8ec07c;">)</span>
<span style="color: #b16286;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Complessità</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
Semplicemente <font color="red"> O(n^3)</font> in quanto vengono eseguiti 3 cicli annidati.
</p>
</blockquote>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2022-05-12 Thu 10:04</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
